aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_dma.cpp
//-------------------------------------------------------------------------------------------------
//
//  File : lib_class_STM32H7_dma.cpp
//
//-------------------------------------------------------------------------------------------------
//
// Copyright(c) 2025 Alain Royer.
// Email: aroyer.qc@gmail.com
//
// Permission is hereby granted, free of charge, to any person obtaining a copy of this software
// and associated documentation files (the "Software"), to deal in the Software without
// restriction, including without limitation the rights to use, copy, modify, merge, publish,
// distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the
// Software is furnished to do so, subject to the following conditions:
//
// The above copyright notice and this permission notice shall be included in all copies or
// substantial portions of the Software.
//
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
// INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
// AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
// DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
//
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
// Include file(s)
//-------------------------------------------------------------------------------------------------

#define DMA_DRIVER_GLOBAL
#include "./lib_digini.h"
#undef  DMA_DRIVER_GLOBAL

//-------------------------------------------------------------------------------------------------
// Define(s)
//-------------------------------------------------------------------------------------------------

#define DMA_DIRECTION_MASK          (uint32_t(DMA_SxCR_DIR_0 | DMA_SxCR_DIR_1))

#define DMA_SxCR_INIT_MASK          (uint32_t(DMA_SxCR_MBURST | DMA_SxCR_PBURST | DMA_SxCR_PL    |\
                                              DMA_SxCR_MSIZE  | DMA_SxCR_PSIZE  | DMA_SxCR_CIRC  |\
                                              DMA_SxCR_MINC   | DMA_SxCR_PINC   | DMA_SxCR_DIR   |\
                                              DMA_SxCR_CT     | DMA_SxCR_DBM))

#define BDMA_CCR_INIT_MASK          (uint32_t(BDMA_CCR_PL    | BDMA_CCR_MSIZE   | BDMA_CCR_PSIZE |\
                                              BDMA_CCR_MINC  | BDMA_CCR_PINC    | BDMA_CCR_CIRC  |\
                                              BDMA_CCR_DIR   | BDMA_CCR_MEM2MEM | BDMA_CCR_DBM   |\
                                              BDMA_CCR_CT))

#if defined(UART9)
#define IS_DMA_UART_USART_REQUEST(__REQUEST__) ((((__REQUEST__) >= DMA_REQUEST_USART1_RX)  &&  ((__REQUEST__) <= DMA_REQUEST_USART3_TX)) || \
                                                (((__REQUEST__) >= DMA_REQUEST_UART4_RX)   &&  ((__REQUEST__) <= DMA_REQUEST_UART5_TX )) || \
                                                (((__REQUEST__) >= DMA_REQUEST_USART6_RX)  &&  ((__REQUEST__) <= DMA_REQUEST_USART6_TX)) || \
                                                (((__REQUEST__) >= DMA_REQUEST_UART7_RX)   &&  ((__REQUEST__) <= DMA_REQUEST_UART8_TX )) || \
                                                (((__REQUEST__) >= DMA_REQUEST_UART9_RX)   &&  ((__REQUEST__) <= DMA_REQUEST_USART10_TX )))
#else
#define IS_DMA_UART_USART_REQUEST(__REQUEST__) ((((__REQUEST__) >= DMA_REQUEST_USART1_RX)  &&  ((__REQUEST__) <= DMA_REQUEST_USART3_TX)) || \
                                                (((__REQUEST__) >= DMA_REQUEST_UART4_RX)   &&  ((__REQUEST__) <= DMA_REQUEST_UART5_TX )) || \
                                                (((__REQUEST__) >= DMA_REQUEST_USART6_RX)  &&  ((__REQUEST__) <= DMA_REQUEST_USART6_TX)) || \
                                                (((__REQUEST__) >= DMA_REQUEST_UART7_RX)   &&  ((__REQUEST__) <= DMA_REQUEST_UART8_TX )))

#endif

#define DMA_SOURCE_TO_DESTINATION_MASK          DMA_SxCR_DIR_Msk

//-------------------------------------------------------------------------------------------------
// Typedef(s)
//-------------------------------------------------------------------------------------------------

struct DMA_BaseRegister_t
{
    volatile uint32_t ISR;          // DMA interrupt status register
    volatile uint32_t Reserved0;
    volatile uint32_t IFCR;         // DMA interrupt flag clear register
};

struct BDMA_BaseRegister_t
{
    volatile uint32_t ISR;          // BDMA interrupt status register
    volatile uint32_t IFCR;         // BDMA interrupt flag clear register
};

//-------------------------------------------------------------------------------------------------
//
//  Function:       Initialize
//
//  Parameter(s):   DMA_Info_t* pInfo
//  Return:         None
//
//  Description:    Setup transfert from source to destination. according to configuration
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::Initialize(DMA_Info_t* pInfo)
{
    m_Handle.pPtr = pInfo->pHandle;
    m_Direction   = pInfo->Config & DMA_DIRECTION_MASK;
    m_pInfo       = pInfo;

    // DMA1 or DMA2 instance
    if(uintptr_t(m_Handle.pPtr) < BDMA_BASE)
    {
        m_DMA_Type     = DMA_TYPE;
        m_StreamNumber = ((uint32_t(m_Handle.pPtr) & 0xFF) - 16) / 24;

        if((uint32_t(m_Handle.pPtr) <= ((uint32_t)DMA2_Stream7) ) && (uint32_t(m_Handle.pPtr) >= ((uint32_t)DMA2_Stream0)))
        {
            SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_DMA2EN);                                                          // Enable Clock for DMA module 2
            m_StreamNumber += 8;
        }
        else
        {
            SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_DMA1EN);                                                          // Enable Clock for DMA module 1
        }

        m_StreamIndex  = ((m_StreamNumber & 0x01) ? 0x06 : 0x00) | ((m_StreamNumber & 0x02) ? 0x10 : 0x00);     // Bitshift of flags within status registers

      #if (DMA_CHECK_FIFO_PARAMS == DEF_ENABLED)
        if(CheckFifoParam(pInfo) != SYS_READY)
        {
            while(1)
            {
                __asm("nop");
            }
        }
      #endif

        CLEAR_BIT(m_Handle.pDMA->CR, DMA_SxCR_EN);                                                              // Disable the DMA
        while((m_Handle.pDMA->CR & DMA_SxCR_EN) != 0) {};                                                       // Check if the DMA Stream is effectively disabled
        MODIFY_REG(m_Handle.pDMA->CR, DMA_SxCR_INIT_MASK, pInfo->Config);                                       // Write the DMA Stream configuration

        // Work around for Errata 2.22: UART/USART- DMA transfer lock: DMA stream could be lock when transferring data to/from USART/UART
      #if (STM32H7_DEV_ID == 0x450UL)
        if((DBGMCU->IDCODE & 0xFFFF0000) >= 0x20000000)
        {
      #endif // STM32H7_DEV_ID == 0x450UL
            if(IS_DMA_UART_USART_REQUEST(pInfo->MUX_Request) != 0)
            {
                SET_BIT(m_Handle.pDMA->CR, DMA_SxCR_TRBUFF);
            }
      #if (STM32H7_DEV_ID == 0x450UL)
        }
      #endif // STM32H7_DEV_ID == 0x450UL

