aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_dma.cpp
        CalcBaseAddress();
        ((DMA_BaseRegister_t *)m_CommonBaseAddress)->IFCR = 0x3F << (m_StreamIndex & 0x1F);                      // Clear all interrupt flags

//--------------------------------------------------------------------------
// FIFO not required at this time..
/*

        MODIFY_REG(m_pHandle.pDMA->FCR, (uint32_t)~(DMA_SxFCR_DMDIS | DMA_SxFCR_FTH), pInfo->FIFO_Config));     // Prepare the DMA Stream FIFO configuration

        if(hdma->Init.FIFOMode == DMA_FIFOMODE_ENABLE)                                                          // the FIFO threshold is not used when the FIFO mode is disabled
        {
            if(hdma->Init.MemBurst != DMA_MEMORY_BURST_SINGLE)                                                  // Check compatibility between FIFO threshold level and size of the memory burst for INCR4, INCR8, INCR16



        MODIFY_REG(m_pHandle.pDMA->FCR, (uint32_t)~(DMA_SxFCR_DMDIS | DMA_SxFCR_FTH, hdma->Init.FIFOMode));     // Prepare the DMA Stream FIFO configuration

        if(hdma->Init.FIFOMode == DMA_FIFOMODE_ENABLE)                                                          // the FIFO threshold is not used when the FIFO mode is disabled
        {
            if(hdma->Init.MemBurst != DMA_MBURST_SINGLE)                                                        // Check compatibility between FIFO threshold level and size of the memory burst for INCR4, INCR8, INCR16
            {
                if(DMA_CheckFifoParam(hdma) != HAL_OK)
                {
                    return HAL_ERROR;
                }
            }

            SET_BIT(m_pHandle.pDMA->FCR, hdma->Init.FIFOThreshold);
        }
*/
//--------------------------------------------------------------------------
    }
    else // BDMA instance(s)
    {
        m_DMA_Type   = BDMA_TYPE;
        m_StreamNumber = ((uint32_t(m_Handle.pPtr) & 0xFF) - 8) / 20;

        CLEAR_BIT(m_Handle.pBDMA->CCR, BDMA_CCR_EN);
        MODIFY_REG(m_Handle.pBDMA->CCR, BDMA_CCR_INIT_MASK, pInfo->Config);

        // Prepare the DMA Channel configuration
        m_StreamIndex = ((uint32_t(m_Handle.pPtr) - uint32_t(BDMA_Channel0)) /
                         (uint32_t(BDMA_Channel1) - uint32_t(BDMA_Channel0))) << 2;                             // calculation of the channel index
        CalcBaseAddress();
        ((BDMA_BaseRegister_t *)m_CommonBaseAddress)->IFCR = ((BDMA_IFCR_CGIF0) << (m_StreamIndex & 0x1F));     // Clear all interrupt flags
    }

    CalcDMAMUX_ChannelBaseAndMask();                                                                            // Initialize parameters for DMAMUX channel : DMAmuxChannel, DMAmuxChannelStatus and DMAmuxChannelStatusMask

// THIS is VERY Strange has BDMA and DMA has different config!!!
    if((pInfo->Config & DMA_SOURCE_TO_DESTINATION_MASK) == DMA_MEMORY_TO_MEMORY)
    {
//TODO          //hdma->Init.Request = DMA_REQUEST_MEM2MEM;                                                     // if memory to memory force the request to 0 ( TODO understand this as the comment is wrong!!
    }

    m_pDMAMUX_Channel->CCR = (pInfo->MUX_Request);                                                              // Set peripheral request  to DMAMUX channel
    m_pDMAMUX_ChannelStatus->CFR = m_DMAMUX_ChannelStatusMask;                                                  // Clear the DMAMUX synchro overrun flag

    // Initialize parameters for DMAMUX request generator : if the DMA request is DMA_REQUEST_GENERATOR0 to DMA_REQUEST_GENERATOR7
    if((pInfo->MUX_Request >= DMA_REQUEST_GENERATOR0) && (pInfo->MUX_Request <= DMA_REQUEST_GENERATOR7))
    {
        CalcDMAMUX_RequestGenBaseAndMask(pInfo->MUX_Request);                                                   // Initialize parameters for DMAMUX request generator : DMAmuxRequestGen, DMAmuxRequestGenStatus and DMAmuxRequestGenStatusMask
        m_pDMAMUX_RequestGen->RGCR = 0;                                                                         // Reset the DMAMUX request generator register
        m_pDMAMUX_RequestGenStatus->RGCFR = m_DMAMUX_RequestGenStatusMask;                                  // Clear the DMAMUX request generator overrun flag
    }
    else
    {
        m_pDMAMUX_RequestGen          = nullptr;
        m_pDMAMUX_RequestGenStatus    = nullptr;
        m_DMAMUX_RequestGenStatusMask = 0;
    }
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       Enable
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    Enable the DMA Stream or Channel
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::Enable(void)
{
     if(m_DMA_Type == DMA_TYPE) SET_BIT(m_Handle.pDMA->CR,   DMA_SxCR_EN);
     else                       SET_BIT(m_Handle.pBDMA->CCR, BDMA_CCR_EN);
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       Disable
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    Disable the DMA Stream or Channel
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::Disable(void)
{
    if(m_DMA_Type == DMA_TYPE) CLEAR_BIT(m_Handle.pDMA->CR,   DMA_SxCR_EN);
    else                       CLEAR_BIT(m_Handle.pBDMA->CCR, BDMA_CCR_EN);
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       SetTransfer
//
//  Parameter(s):   Source
//                  Destination
//                  Length
//  Return:         None
//
//  Description:    Setup transfer from source to destination. according to configuration
//
//  Note(s):        Add in direction support for M2M
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::SetTransfer(void* pSource, void* pDestination, size_t Length)
{
    if(m_Direction == DMA_MEMORY_TO_PERIPHERAL)
    {
        if(m_DMA_Type == DMA_TYPE)
        {
            m_Handle.pDMA->M0AR = uint32_t(pSource);
            m_Handle.pDMA->PAR  = uint32_t(pDestination);
        }
        else
        {
            m_Handle.pBDMA->CM0AR = uint32_t(pSource);
            m_Handle.pBDMA->CPAR  = uint32_t(pDestination);
        }
    }
    else
    {
        if(m_DMA_Type == DMA_TYPE)
        {
            m_Handle.pDMA->M0AR = uint32_t(pDestination);
            m_Handle.pDMA->PAR  = uint32_t(pSource);
        }
        else
        {
            m_Handle.pBDMA->CM0AR = uint32_t(pDestination);
            m_Handle.pBDMA->CPAR  = uint32_t(pSource);
        }
    }

