aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_dma.cpp
    if(m_DMA_Type == DMA_TYPE) m_Handle.pDMA->NDTR   = uint32_t(Length);
    else                       m_Handle.pBDMA->CNDTR = uint32_t(Length);
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       SetSource
//
//  Parameter(s):   Source
//  Return:         None
//
//  Description:    Setup source for transfer from source to destination. according to
//                  configuration
//
//  Note(s):        Add in direction support for M2M
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::SetSource(void* pSource)
{
    if(m_Direction == DMA_MEMORY_TO_PERIPHERAL)
    {
        if(m_DMA_Type == DMA_TYPE) m_Handle.pDMA->M0AR   = uint32_t(pSource);
        else                       m_Handle.pBDMA->CM0AR = uint32_t(pSource);
    }
    else
    {
        if(m_DMA_Type == DMA_TYPE) m_Handle.pDMA->PAR   = uint32_t(pSource);
        else                       m_Handle.pBDMA->CPAR = uint32_t(pSource);
    }
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       SetDestination
//
//  Parameter(s):   Destination
//  Return:         None
//
//  Description:    Setup destination for transfer from source to destination. according to
//                  configuration
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::SetDestination(void* Destination)
{
    if(m_Direction == DMA_MEMORY_TO_PERIPHERAL)
    {
        if(m_DMA_Type == DMA_TYPE) m_Handle.pDMA->PAR   = uint32_t(Destination);
        else                       m_Handle.pBDMA->CPAR = uint32_t(Destination);
    }
    else
    {
        if(m_DMA_Type == DMA_TYPE) m_Handle.pDMA->M0AR   = uint32_t(Destination);
        else                       m_Handle.pBDMA->CM0AR = uint32_t(Destination);
    }
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       ClearFlag
//
//  Parameter(s):   Flag        Flag to clear
//  Return:         None
//
//  Description:    Clear flag for specific DMA stream.
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::ClearFlag(uint32_t Flag)
{
    volatile uint32_t* pRegister = nullptr;

    if(m_DMA_Type == DMA_TYPE)
    {
        pRegister = (uint32_t*)&((DMA_BaseRegister_t *)m_CommonBaseAddress)->IFCR;
    }
    else // BDMA_TYPE
    {
        pRegister = (uint32_t*)&((BDMA_BaseRegister_t *)m_CommonBaseAddress)->IFCR;
    }

    if(pRegister != nullptr)
    {
        SET_BIT(*pRegister, Flag);
    }
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       GetLength
//
//  Parameter(s):   None
//  Return:         The actual lenght in the register
//
//  Description:    Return the actual remaining length of DMA
//
//-------------------------------------------------------------------------------------------------
size_t DMA_Driver::GetLength(void)
{
    if(m_DMA_Type == DMA_TYPE) return size_t(m_Handle.pDMA->NDTR);
                               return size_t(m_Handle.pBDMA->CNDTR);
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       SetLength
//
//  Parameter(s):
//  Return:         None
//
//  Description:
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::SetLength(size_t Length)
{
    if(m_DMA_Type == DMA_TYPE) m_Handle.pDMA->NDTR   = uint32_t(Length);
    else                       m_Handle.pBDMA->CNDTR = uint32_t(Length);
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       SetMemoryIncrement
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::SetMemoryIncrement(void)
{
    if(m_DMA_Type == DMA_TYPE) SET_BIT(m_Handle.pDMA->CR,   DMA_SxCR_MINC);
    else                       SET_BIT(m_Handle.pBDMA->CCR, BDMA_CCR_MINC);
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       SetNoMemoryIncrement
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::SetNoMemoryIncrement(void)
{
    if(m_DMA_Type == DMA_TYPE) CLEAR_BIT(m_Handle.pDMA->CR,   DMA_SxCR_MINC);
    else                       CLEAR_BIT(m_Handle.pBDMA->CCR, BDMA_CCR_MINC);
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       SetFifoControl
//
//  Parameter(s):
//  Return:         None
//
//  Description:
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::SetFifoControl(uint32_t Control)
{
    if(m_DMA_Type == DMA_TYPE)
    {
        m_Handle.pDMA->FCR = Control;
    }
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       CheckFlag
//
//  Parameter(s):   Flag        Flag to check
//  Return:         bool        If true then flag is set.
//
//  Description:    Check flag for specific DMA stream.
//
//-------------------------------------------------------------------------------------------------
bool DMA_Driver::CheckFlag(uint32_t Flag)
{
    volatile uint32_t Register = 0;
    bool              Result   = false;

    if(m_DMA_Type == DMA_TYPE)
    {
        Register = ((DMA_BaseRegister_t *)m_CommonBaseAddress)->ISR;
    }
    else // BDMA_TYPE
    {
        Register = ((BDMA_BaseRegister_t *)m_CommonBaseAddress)->ISR;
    }

