aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_dma.cpp
    if((Register & Flag) != 0)
    {
        Result = true;
    }

    return Result;
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       EnableClock
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    Enable the associated DMA module clock
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::EnableClock(void)
{

    if(uintptr_t(m_Handle.pBDMA) < BDMA_BASE)
    {
        if(uintptr_t(m_Handle.pDMA) < DMA2_Stream0_BASE)
        {
            SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_DMA1EN);
        }
        else
        {
            SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_DMA2EN);
        }
    }
    else
    {
      #ifdef RCC_AHB4ENR_BDMAEN
        SET_BIT(RCC->AHB4ENR, RCC_AHB4ENR_BDMAEN);
      #endif

      #ifdef RCC_AHB4ENR_BDMA2EN
        SET_BIT(RCC->AHB4ENR, RCC_AHB4ENR_BDMA2EN);
      #endif
    }
}

//-------------------------------------------------------------------------------------------------
//
//  Name:           EnableIRQ
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    Enable the IRQ DMA for the Channel and Stream
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::EnableIRQ(void)
{
    ISR_Init(m_pInfo->IRQn_Channel, m_pInfo->PreempPrio);
}

//-------------------------------------------------------------------------------------------------
//
//  Name:           EnableInterrupt
//
//  Parameter(s):   uint32_t    Interrupt
//  Return:         None
//
//  Description:    Enable the interrupt functionnalities at the DMA module
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::EnableInterrupt(uint32_t Interrupt)
{
    if(m_DMA_Type == DMA_TYPE) SET_BIT(m_Handle.pDMA->CR,   Interrupt);
    else                       SET_BIT(m_Handle.pBDMA->CCR, Interrupt);
}

//-------------------------------------------------------------------------------------------------
//
//  Name:           DisableInterrupt
//
//  Parameter(s):   uint32_t    Interrupt
//  Return:         None
//
//  Description:    Disable the interrupt functionnalities at the DMA module
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::DisableInterrupt(uint32_t Interrupt)
{
    if(m_DMA_Type == DMA_TYPE) CLEAR_BIT(m_Handle.pDMA->CR,   Interrupt);
    else                       CLEAR_BIT(m_Handle.pBDMA->CCR, Interrupt);
}

//-------------------------------------------------------------------------------------------------
//
//  Name:           EnableTransmitCompleteInterrupt
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    Enable the interrupt transmit completed at the DMA module
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::EnableTransmitCompleteInterrupt(void)
{
    if(m_DMA_Type == DMA_TYPE) SET_BIT(m_Handle.pDMA->CR,   DMA_SxCR_TCIE);
    else                       SET_BIT(m_Handle.pBDMA->CCR, BDMA_CCR_TCIE);
}

//-------------------------------------------------------------------------------------------------
//
//  Name:           DisableTransmitCompleteInterrupt
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    Disable the interrupt transmit completed at the DMA module
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::DisableTransmitCompleteInterrupt(void)
{
    if(m_DMA_Type == DMA_TYPE) CLEAR_BIT(m_Handle.pDMA->CR,   DMA_SxCR_TCIE);
    else                       CLEAR_BIT(m_Handle.pBDMA->CCR, BDMA_CCR_TCIE);
}

//-------------------------------------------------------------------------------------------------
//
//  Name:           EnableTransmitHalfCompleteInterrupt
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    Enable the interrupt half transmit completed at the DMA module
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::EnableTransmitHalfCompleteInterrupt(void)
{
    if(m_DMA_Type == DMA_TYPE) SET_BIT(m_Handle.pDMA->CR,   DMA_SxCR_HTIE);
    else                       SET_BIT(m_Handle.pBDMA->CCR, BDMA_CCR_HTIE);
}

//-------------------------------------------------------------------------------------------------
//
//  Name:           DisableTransmitHalfCompleteInterrupt
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    Disable the interrupt half transmit completed at the DMA module
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::DisableTransmitHalfCompleteInterrupt(void)
{
    if(m_DMA_Type == DMA_TYPE) CLEAR_BIT(m_Handle.pDMA->CR,   DMA_SxCR_HTIE);
    else                       CLEAR_BIT(m_Handle.pBDMA->CCR, BDMA_CCR_HTIE);
}

//-------------------------------------------------------------------------------------------------
//
//  Name:           CheckFifoParam
//
//  Parameter(s):   DMA_Info_t* pInfo   Pointer to a configuration structure.
//  Return:         SystemState_e
//
//  Description:    Check compatibility between FIFO threshold level and size of the memory burst
//
//  Note(s):        Use this function only at development.
//
//-------------------------------------------------------------------------------------------------
#if (DMA_CHECK_FIFO_PARAMS == DEF_ENABLED)
SystemState_e DMA_Driver::CheckFifoParam(DMA_Info_t* pInfo)
{
    SystemState_e State = SYS_READY;

    if((pInfo->Config & DMA_SxCR_MSIZE_Msk) == DMA_MEMORY_SIZE_8_BITS)             // Memory Data size equal to Byte
    {
        switch(pInfo->FIFO_Config & DMA_SxFCR_FTH_Msk)
        {
            case DMA_FIFO_THRESHOLD_1_QUARTER_FULL:
            case DMA_FIFO_THRESHOLD_3_QUARTERS_FULL:
            {
                if((pInfo->Config & DMA_SxCR_MBURST_Msk) == DMA_MEMORY_BURST_INC8)
                {
                    State = SYS_INVALID_PARAMETER;
                }
            }
            break;

