aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_dma.cpp
            case DMA_FIFO_THRESHOLD_HALF_FULL:
            {
                if((pInfo->Config & DMA_SxCR_MBURST_Msk) == DMA_MEMORY_BURST_INC16)
                {
                    State = SYS_INVALID_PARAMETER;
                }
            }
            break;

            // case DMA_FIFO_THRESHOLD_FULL:
            default:
            break;
        }
    }
    else if((pInfo->Config & DMA_SxCR_MSIZE_Msk) == DMA_MEMORY_SIZE_16_BITS)                   // Memory Data size equal to Half-Word
    {
        switch(pInfo->FIFO_Config & DMA_SxFCR_FTH_Msk)
        {
            case DMA_FIFO_THRESHOLD_1_QUARTER_FULL:
            case DMA_FIFO_THRESHOLD_3_QUARTERS_FULL:
            {
                State = SYS_INVALID_PARAMETER;
            }
            break;

            case DMA_FIFO_THRESHOLD_HALF_FULL:
            {
                if((pInfo->Config & DMA_SxCR_MBURST_Msk) == DMA_MEMORY_BURST_INC8)
                {
                    State = SYS_INVALID_PARAMETER;
                }
            }
            break;

            case DMA_FIFO_THRESHOLD_FULL:
            {
                if((pInfo->Config & DMA_SxCR_MBURST_Msk) == DMA_MEMORY_BURST_INC16)
                {
                    State = SYS_INVALID_PARAMETER;
                }
            }
            break;

            default:
            break;
        }
    }
    else                                                                                        // Memory Data size equal to Word
    {
        switch(pInfo->FIFO_Config & DMA_SxFCR_FTH_Msk)
        {
            case DMA_FIFO_THRESHOLD_1_QUARTER_FULL:
            case DMA_FIFO_THRESHOLD_HALF_FULL:
            case DMA_FIFO_THRESHOLD_3_QUARTERS_FULL:
            {
                State = SYS_INVALID_PARAMETER;
            }
            break;

            case DMA_FIFO_THRESHOLD_FULL:
            {
                if((pInfo->Config & DMA_SxCR_MBURST_Msk) == DMA_MEMORY_BURST_INC8)
                {
                    State = SYS_INVALID_PARAMETER;
                }
            }
            break;

            default:
            break;
        }
    }

    return State;
}
#endif

//-------------------------------------------------------------------------------------------------
//
//  Name:           CalcBaseAddress
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    Returns the DMA Stream base address depending on stream number
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::CalcBaseAddress(void)
{
    if(m_DMA_Type == DMA_TYPE) // DMA1 or DMA2 instance
    {
        m_CommonBaseAddress = (uint32_t(m_Handle.pPtr) & uint32_t(~0x3FF));     // Pointer to LISR and LIFCR

        if(m_StreamNumber > 3)
        {
            m_CommonBaseAddress += 4;                                           // Pointer to HISR and HIFCR
        }
    }
    else // BDMA instance
    {
        m_CommonBaseAddress = (uint32_t(m_Handle.pPtr) & uint32_t(~0xFF));      // Pointer to ISR and IFCR
    }
}

//-------------------------------------------------------------------------------------------------
//
//  Name:           CalcDMAMUX_ChannelBaseAndMask
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    Updates the DMAMUX channel and status mask depending on stream number
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::CalcDMAMUX_ChannelBaseAndMask(void)
{
    uint32_t DMAMUX_ChannelAddress;

    if(m_DMA_Type == DMA_TYPE)  // DMA1 or DMA2 instance
    {
        DMAMUX_ChannelAddress   = DMAMUX1_Channel0;
        m_pDMAMUX_ChannelStatus = DMAMUX1_ChannelStatus;
    }
    else                        // BDMA instance
    {
        // BDMA Channels are connected to DMAMUX2 channels
        DMAMUX_ChannelAddress   = DMAMUX2_Channel0;
        m_pDMAMUX_ChannelStatus = DMAMUX2_ChannelStatus;
    }

    m_pDMAMUX_Channel          = (DMAMUX_Channel_TypeDef *)((uint32_t)(((uint32_t)DMAMUX_ChannelAddress) + (m_StreamNumber * 4)));
    m_DMAMUX_ChannelStatusMask = uint32_t(1) << (m_StreamNumber & 0x1F);
}

//-------------------------------------------------------------------------------------------------
//
//  Name:           CalcDMAMUX_RequestGenBaseAndMask
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    Updates the DMAMUX request generator params
//
//-------------------------------------------------------------------------------------------------
void DMA_Driver::CalcDMAMUX_RequestGenBaseAndMask(uint32_t Request)
{
    uint32_t DMAMUX_RequestGeneratorAddress;

    if(m_DMA_Type == DMA_TYPE) // DMA1 or DMA2 instance
    {
        // DMA1 and DMA2 Streams use DMAMUX1 request generator blocks
        DMAMUX_RequestGeneratorAddress = uint32_t(DMAMUX1_RequestGenerator0);
        m_pDMAMUX_RequestGenStatus     = DMAMUX1_RequestGenStatus;
    }
    else
    {
        // BDMA Channels are connected to DMAMUX2 request generator blocks
        DMAMUX_RequestGeneratorAddress = uint32_t(DMAMUX2_RequestGenerator0);
        m_pDMAMUX_RequestGenStatus     = DMAMUX2_RequestGenStatus;
    }

    m_pDMAMUX_RequestGen          = (DMAMUX_RequestGen_TypeDef *)((uint32_t)((DMAMUX_RequestGeneratorAddress) + ((Request - 1) * 4)));
    m_DMAMUX_RequestGenStatusMask = uint32_t(1) << (Request - 1);
}

//-------------------------------------------------------------------------------------------------
